[
  {
    "id": "demo_card_jordan_1",
    "query": "What does Jordan Lee use to check his strength and mobility form at home after a full day at the desk?",
    "response": "When I’m programming or reviewing client plans all day, I don’t want to guess about my own form. I put on the FlowForm Motion Suit and run through a short sequence of squats, lunges, and hinges in my apartment. The suit’s sensors give me instant feedback on how my joints are tracking, so I can clean up little compensations before they turn into habits. It’s like having an extra coach watching me, even when I’m training alone.",
    "imageUrl": "/images/jordan_lee/cards/card_jordan_lee_PUew7bQ-7o7QGF8ajxQEK.png",
    "imageBrief": "Jordan Lee in a FlowForm motion suit doing dumbbell lunges in a small apartment strength corner, sensors visible on arms and legs."
  },
  {
    "id": "demo_card_jordan_2",
    "query": "Is FlowForm Motion Suit actually useful for everyday lifters, or just pro athletes like Jordan Lee?",
    "response": "Most of the people I coach are not pros—they’re busy desk workers who train a few times a week. I use the FlowForm Motion Suit to show them how their squats and presses look in real time. The suit doesn’t care how strong you are; it just reflects how you’re moving. That feedback is especially powerful for beginners who don’t have years of body awareness yet.",
    "imageUrl": "/images/jordan_lee/cards/card_jordan_lee_PUew7bQ-7o7QGF8ajxQEK.png",
    "imageBrief": "Jordan Lee coaching a lifter while wearing the FlowForm motion suit in a compact home gym, barbell rack and plates in the background."
  },
  {
    "id": "demo_card_jordan_3",
    "query": "How does Jordan Lee use FlowForm to balance yoga-style control with strength training?",
    "response": "The way I think about FlowForm is bringing yoga-like control into strength work. I’ll flow between holds—like a long lunge or single-leg balance—and loaded movements, all while wearing the suit. The sensors highlight when I lose alignment or rush a rep. That keeps my sessions honest and lets me build strength without sacrificing the quality of my movement.",
    "imageUrl": "/images/jordan_lee/cards/card_jordan_lee_PUew7bQ-7o7QGF8ajxQEK.png",
    "imageBrief": "Jordan Lee in the FlowForm motion suit flowing between a yoga lunge and a dumbbell press in a bright, minimalist living room."
  }
]

