[
  {
    "id": "demo_card_priya_1",
    "query": "What does Priya Nair use to keep her hips and lower back mobile after long days sitting at a desk?",
    "response": "When I spend most of the day editing videos or answering messages, my hips and lower back are the first things to get tight. I put on the FlowForm Motion Suit and run through a short mobility flow in my living room—deep hip openers, gentle spinal rotations, and controlled lunges. The sensors show me when I’m cutting a range of motion short or twisting too much through my lower back. That feedback lets me smooth out my movement, so each session actually restores my body instead of just going through the motions.",
    "imageUrl": "/images/priya_nair/cards/Priya%20Nair%20card.png",
    "imageBrief": "Priya Nair in a FlowForm motion suit doing a deep hip mobility sequence in a small apartment, sensors visible on hips and spine, calm daylight."
  },
  {
    "id": "demo_card_priya_2",
    "query": "Is the FlowForm Motion Suit useful for people who only do light strength and mobility work like Priya Nair’s routines?",
    "response": "Most of my community isn’t training like pro athletes—they’re working on light strength and mobility a few times a week. I use the FlowForm Motion Suit to make those simple sessions much more intentional. When I’m coaching bodyweight squats, split squats, or band work, the suit flags when knees are collapsing in, when the pelvis is dumping forward, or when someone is shifting into their \"good\" side. For people following my routines at home, that kind of objective feedback is what keeps them progressing without flaring up old nagging issues.",
    "imageUrl": "/images/priya_nair/cards/Priya%20Nair%20card.png",
    "imageBrief": "Priya Nair wearing the FlowForm suit demonstrating a split squat and light dumbbell work in a bright, minimalist living room, with subtle sensor glow."
  },
  {
    "id": "demo_card_priya_3",
    "query": "How does Priya Nair use FlowForm to catch movement patterns that might lead to overuse injuries?",
    "response": "My whole thing is helping people notice the small compensation patterns before they turn into overuse injuries. In my own training, I wear the FlowForm Motion Suit for slow mobility drills and short conditioning blocks. The suit tracks joint angles and asymmetries rep by rep—so if I start leaning away from a sensitive ankle or loading one hip more than the other, I see it instantly. I can cue myself to back off, adjust the drill, or add support before it becomes a bigger problem. That’s the kind of awareness I want my audience to have, even when they’re training alone at home.",
    "imageUrl": "/images/priya_nair/cards/Priya%20Nair%20card.png",
    "imageBrief": "Priya Nair in the FlowForm suit moving between a controlled lateral lunge and a balance hold, sensors highlighting knees and ankles, with a simple mobility corner setup."
  }
]

